In [1]:
import pandas as pd

In [2]:
#Dataframe
df=pd.read_csv("employee_detail.csv")
df

   employeeid emaployeename  salary department  branch
0           1        sameer   45000         hr  mumbai
1           2        Ramesh   35000      admin    pune
2           3        Hitesh   65000         hr  mumbai
3           4        nitesh   95000      sales    pune
4           5        jayesh   75000      sales  mumbai

In [3]:
df.branch

0    mumbai
1      pune
2    mumbai
3      pune
4    mumbai
Name: branch, dtype: object

In [4]:
df["branch"]

0    mumbai
1      pune
2    mumbai
3      pune
4    mumbai
Name: branch, dtype: object

In [5]:
df[["employeeid", "employeename"]]

KeyError: "['employeename'] not in index"

In [6]:
df[df["branch"]=="mumbai"]

   employeeid emaployeename  salary department  branch
0           1        sameer   45000         hr  mumbai
2           3        Hitesh   65000         hr  mumbai
4           5        jayesh   75000      sales  mumbai

In [7]:
df.salary

0    45000
1    35000
2    65000
3    95000
4    75000
Name: salary, dtype: int64

In [8]:
df["salary"].sum()

315000

In [ ]:
df["salary"].min()

In [18]:
df["salary"].max()

95000

In [17]:
df["salary"].count()

5

In [16]:
df["salary"].mean()

63000.0

In [15]:
df["salary"].describe()

count        5.000000
mean     63000.000000
std      23874.672773
min      35000.000000
25%      45000.000000
50%      65000.000000
75%      75000.000000
max      95000.000000
Name: salary, dtype: float64

In [14]:
df[df["salary"]==df["salary"].max()]

   employeeid emaployeename  salary department branch  annual_salary
3           4        nitesh   95000      sales   pune        1140000

In [13]:
#WAP to display employees whose salary is more than 50000
df[df["salary"]>50000]

   employeeid emaployeename  salary department  branch  annual_salary
2           3        Hitesh   65000         hr  mumbai         780000
3           4        nitesh   95000      sales    pune        1140000
4           5        jayesh   75000      sales  mumbai         900000

In [12]:
#WAP to display all the employee whose branch in bangalore 
df[df["branch"]=="bangalore"]

Empty DataFrame
Columns: [employeeid, emaployeename, salary, department, branch, annual_salary]
Index: []

In [19]:
#WAP to display all the employees whose branch is mumbai and salary 
#is greater then 60000

df[(df["salary"]>60000) & (df["branch"]=="pune")]

   employeeid emaployeename  salary department branch  annual_salary
3           4        nitesh   95000      sales   pune        1140000

In [9]:
df["annual_salary"]=df["salary"]*12

In [10]:
df

   employeeid emaployeename  salary department  branch  annual_salary
0           1        sameer   45000         hr  mumbai         540000
1           2        Ramesh   35000      admin    pune         420000
2           3        Hitesh   65000         hr  mumbai         780000
3           4        nitesh   95000      sales    pune        1140000
4           5        jayesh   75000      sales  mumbai         900000

In [25]:
df.to_csv("employee_detail.csv", index=False)